In [1]:
import pandas as pd
%matplotlib inline

In [2]:
data = pd.read_csv('power.csv', sep=',')

In [3]:
data.sort_values(by='quantity', ascending=True).head()
# data.sort_values(by='year', ascending=False).head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

## Сортировка по нескольким столбцам осуществляется методом sort_values

In [4]:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, True]).head()

            country  year  quantity  category
24227   Afghanistan  1990      -1.0         4
21688   Afghanistan  1990       0.0         4
508445  Afghanistan  1990       0.0        31
514814  Afghanistan  1990       0.0        31
809720  Afghanistan  1990       0.0        42

In [5]:
# data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

In [6]:
data

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31
...             ...   ...        ...       ...
507965     Zimbabwe  2014        0.0        31
609562     Zimbabwe  2014        0.0        35
630816     Zimbabwe  2014        0.0        37
639012     Zimbabwe  2014        0.0        37
871611     Zimbabwe  2014        0.0        48

[1189482 rows x 4 columns]

In [9]:
data = pd.read_csv('transactions.csv', sep=';')

In [10]:
# data[data['Product'] == '_8'].sort_values(by='Cost').reset_index().loc[0]['ID']
data[data['Product'] == '_8'].sort_values(by='Cost').reset_index().loc[0]['ID']

't023'